#+TITLE: Emacs configuration file
#+AUTHOR: harritaylor
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes
#+STARTUP: overview

Based off the wonderful [[https://bitbucket.org/mituharu/emacs-mac/src/master/README-mac][Emacs Mac Port]], these are my dotfiles.
Keep in mind: shift and pinch set full screen / not fullscreen, pinch sets font size, and side swiping switches between buffers.

** Functional

Evil-mode colourings
#+begin_src emacs-lisp :tangle yes
;; (setq evil-default-cursor (quote (t "#750000"))
;;       evil-visual-state-cursor '("green" hollow)
;;       evil-normal-state-cursor '("green" box)

;;       evil-insert-state-cursor '("pink" (bar . 2)))
#+end_src


Matching parenthesis appearance.
#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :config
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
;; (set-face-background 'show-paren-match "wheat")
;; (set-face-attribute 'show-paren-match nil :weight 'extra-bold)
;; (show-paren-mode)
#+END_SRC

Use spaces instead of tabs.
#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
(setq-default c-basic-indent 2)
(setq-default c-basic-offset 2)
(setq-default tab-width 2)
(setq tab-width 2)
(setq js-indent-level 2)
(setq css-indent-offset 2)
(setq c-basic-offset 2)
#+END_SRC

Visual lines.
#+BEGIN_SRC emacs-lisp
;; (global-visual-line-mode t)
;; (global-linum-mode t)
;; (setq linum-format "%4d \u2502 ")
#+END_SRC

#+RESULTS:
: %4d │

Vi-tilde fringes
#+begin_src emacs-lisp :tangle yes
(use-package vi-tilde-fringe
  :config
  (global-vi-tilde-fringe-mode 1))
#+end_src
